# InvalidAreaLoadSketch Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SketchFailures..::..InvalidAreaLoadSketch Property
BuiltInFailures..::..SketchFailures Class See Also
---
Area Load has invalid Sketch.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId InvalidAreaLoadSketch { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property InvalidAreaLoadSketch As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ InvalidAreaLoadSketch {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SketchFailures Class
Autodesk.Revit.DB Namespace